mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
/*!
 * Silicon Laboratories Confidential
 * Copyright 2011 Silicon Laboratories, Inc.
 *
 * THIS FILE IS AUTOMATICALLY GENERATED. DO NOT EDIT!
 */

#ifndef _SI4455_DEFS_H_
#define _SI4455_DEFS_H_


/* This section contains command map declarations */
struct si4455_reply_GENERIC_map {
    uint8_t  REPLY1;
    uint8_t  REPLY2;
    uint8_t  REPLY3;
    uint8_t  REPLY4;
    uint8_t  REPLY5;
    uint8_t  REPLY6;
    uint8_t  REPLY7;
    uint8_t  REPLY8;
    uint8_t  REPLY9;
    uint8_t  REPLY10;
    uint8_t  REPLY11;
    uint8_t  REPLY12;
    uint8_t  REPLY13;
    uint8_t  REPLY14;
    uint8_t  REPLY15;
    uint8_t  REPLY16;
};

struct si4455_reply_PART_INFO_map {
    uint8_t  CHIPREV;
    SI_UU16_t PART;
    uint8_t  PBUILD;
    SI_UU16_t ID;
    uint8_t  CUSTOMER;
    uint8_t  ROMID;
    uint8_t  BOND;
};

struct si4455_reply_TEST_DATA_map {
    uint8_t  TEST0;
    uint8_t  TEST1;
    uint8_t  TEST2;
    uint8_t  TEST3;
    uint8_t  TEST4;
    uint8_t  TEST5;
    uint8_t  TEST6;
    uint8_t  TEST7;
    uint8_t  TEST8;
    uint8_t  TEST9;
    uint8_t  TESTA;
    uint8_t  TESTB;
    uint8_t  TESTC;
    uint8_t  TESTD;
    uint8_t  TESTE;
    uint8_t  TESTF;
};

struct si4455_reply_FUNC_INFO_map {
    uint8_t  REVEXT;
    uint8_t  REVBRANCH;
    uint8_t  REVINT;
    SI_UU16_t PATCH;
    uint8_t  FUNC;
    uint8_t  SVNFLAGS;
    SI_UU32_t SVNREV;
};

struct si4455_reply_GET_PROPERTY_map {
    uint8_t  DATA0;
    uint8_t  DATA1;
    uint8_t  DATA2;
    uint8_t  DATA3;
    uint8_t  DATA4;
    uint8_t  DATA5;
    uint8_t  DATA6;
    uint8_t  DATA7;
    uint8_t  DATA8;
    uint8_t  DATA9;
    uint8_t  DATA10;
    uint8_t  DATA11;
    uint8_t  DATA12;
    uint8_t  DATA13;
    uint8_t  DATA14;
    uint8_t  DATA15;
};

struct si4455_reply_GPIO_PIN_CFG_map {
    uint8_t  GPIO0;
    uint8_t  GPIO1;
    uint8_t  GPIO2;
    uint8_t  GPIO3;
    uint8_t  NIRQ;
    uint8_t  SDO;
    uint8_t  GEN_CONFIG;
};

struct si4455_reply_FIFO_INFO_map {
    uint8_t  RX_FIFO_COUNT;
    uint8_t  TX_FIFO_SPACE;
};

struct si4455_reply_EZCONFIG_CHECK_map {
    uint8_t  RESULT;
};

struct si4455_reply_GET_INT_STATUS_map {
    uint8_t  INT_PEND;
    uint8_t  INT_STATUS;
    uint8_t  PH_PEND;
    uint8_t  PH_STATUS;
    uint8_t  MODEM_PEND;
    uint8_t  MODEM_STATUS;
    uint8_t  CHIP_PEND;
    uint8_t  CHIP_STATUS;
};

struct si4455_reply_GET_PH_STATUS_map {
    uint8_t  PH_PEND;
    uint8_t  PH_STATUS;
};

struct si4455_reply_GET_MODEM_STATUS_map {
    uint8_t  MODEM_PEND;
    uint8_t  MODEM_STATUS;
    uint8_t  CURR_RSSI;
    uint8_t  LATCH_RSSI;
    uint8_t  ANT1_RSSI;
    uint8_t  ANT2_RSSI;
    SI_UU16_t AFC_FREQ_OFFSET;
};

struct si4455_reply_GET_CHIP_STATUS_map {
    uint8_t  CHIP_PEND;
    uint8_t  CHIP_STATUS;
    uint8_t  CMD_ERR_STATUS;
};

struct si4455_reply_REQUEST_DEVICE_STATE_map {
    uint8_t  CURR_STATE;
    uint8_t  CURRENT_CHANNEL;
};

struct si4455_reply_READ_CMD_BUFF_map {
    uint8_t  CMD_BUFF0;
    uint8_t  CMD_BUFF1;
    uint8_t  CMD_BUFF2;
    uint8_t  CMD_BUFF3;
    uint8_t  CMD_BUFF4;
    uint8_t  CMD_BUFF5;
    uint8_t  CMD_BUFF6;
    uint8_t  CMD_BUFF7;
    uint8_t  CMD_BUFF8;
    uint8_t  CMD_BUFF9;
    uint8_t  CMD_BUFF10;
    uint8_t  CMD_BUFF11;
    uint8_t  CMD_BUFF12;
    uint8_t  CMD_BUFF13;
    uint8_t  CMD_BUFF14;
    uint8_t  CMD_BUFF15;
};

struct si4455_reply_FRR_A_READ_map {
    uint8_t  FRR_A_VALUE;
    uint8_t  FRR_B_VALUE;
    uint8_t  FRR_C_VALUE;
    uint8_t  FRR_D_VALUE;
};

struct si4455_reply_FRR_B_READ_map {
    uint8_t  FRR_B_VALUE;
    uint8_t  FRR_C_VALUE;
    uint8_t  FRR_D_VALUE;
    uint8_t  FRR_A_VALUE;
};

struct si4455_reply_FRR_C_READ_map {
    uint8_t  FRR_C_VALUE;
    uint8_t  FRR_D_VALUE;
    uint8_t  FRR_A_VALUE;
    uint8_t  FRR_B_VALUE;
};

struct si4455_reply_FRR_D_READ_map {
    uint8_t  FRR_D_VALUE;
    uint8_t  FRR_A_VALUE;
    uint8_t  FRR_B_VALUE;
    uint8_t  FRR_C_VALUE;
};

struct si4455_reply_GET_ADC_READING_map {
    SI_UU16_t GPIO_ADC;
    SI_UU16_t BATTERY_ADC;
    SI_UU16_t TEMP_ADC;
    uint8_t  TEMP_SLOPE;
    uint8_t  TEMP_INTERCEPT;
};


/* The union that stores the reply written back to the host registers */
union si4455_cmd_reply_union {
    uint8_t                                                                     RAW[16];
    struct si4455_reply_GENERIC_map                                        GENERIC;
    struct si4455_reply_PART_INFO_map                                      PART_INFO;
    struct si4455_reply_TEST_DATA_map                                      TEST_DATA;
    struct si4455_reply_FUNC_INFO_map                                      FUNC_INFO;
    struct si4455_reply_GET_PROPERTY_map                                   GET_PROPERTY;
    struct si4455_reply_GPIO_PIN_CFG_map                                   GPIO_PIN_CFG;
    struct si4455_reply_FIFO_INFO_map                                      FIFO_INFO;
    struct si4455_reply_EZCONFIG_CHECK_map                                 EZCONFIG_CHECK;
    struct si4455_reply_GET_INT_STATUS_map                                 GET_INT_STATUS;
    struct si4455_reply_GET_PH_STATUS_map                                  GET_PH_STATUS;
    struct si4455_reply_GET_MODEM_STATUS_map                               GET_MODEM_STATUS;
    struct si4455_reply_GET_CHIP_STATUS_map                                GET_CHIP_STATUS;
    struct si4455_reply_REQUEST_DEVICE_STATE_map                           REQUEST_DEVICE_STATE;
    struct si4455_reply_READ_CMD_BUFF_map                                  READ_CMD_BUFF;
    struct si4455_reply_FRR_A_READ_map                                     FRR_A_READ;
    struct si4455_reply_FRR_B_READ_map                                     FRR_B_READ;
    struct si4455_reply_FRR_C_READ_map                                     FRR_C_READ;
    struct si4455_reply_FRR_D_READ_map                                     FRR_D_READ;
    struct si4455_reply_GET_ADC_READING_map                                GET_ADC_READING;
};


#define SI4455_CMD_ID_NOP                                                      0x00
//NOP ARGS
#define SI4455_CMD_ARG_COUNT_NOP                                               1
//NOP REPLY
#define SI4455_CMD_REPLY_COUNT_NOP                                             0

#define SI4455_CMD_ID_PART_INFO                                                0x01
//PART_INFO ARGS
#define SI4455_CMD_ARG_COUNT_PART_INFO                                         1
//PART_INFO REPLY
#define SI4455_CMD_REPLY_COUNT_PART_INFO                                       9
    #define SI4455_CMD_PART_INFO_REP_CHIPREV_TYPE u8
    #define SI4455_CMD_PART_INFO_REP_CHIPREV_SIZE 8
    #define SI4455_CMD_PART_INFO_REP_CHIPREV_MASK 0xFF
    #define SI4455_CMD_PART_INFO_REP_CHIPREV_MSB  7
    #define SI4455_CMD_PART_INFO_REP_CHIPREV_LSB  0
    #define SI4455_CMD_PART_INFO_REP_CHIPREV_INDEX 1
    #define SI4455_CMD_PART_INFO_REP_PART_TYPE u16
    #define SI4455_CMD_PART_INFO_REP_PART_SIZE 16
    #define SI4455_CMD_PART_INFO_REP_PART_MASK 0xFFFF
    #define SI4455_CMD_PART_INFO_REP_PART_MSB  15
    #define SI4455_CMD_PART_INFO_REP_PART_LSB  0
    #define SI4455_CMD_PART_INFO_REP_PART_INDEX 2
    #define SI4455_CMD_PART_INFO_REP_PBUILD_TYPE u8
    #define SI4455_CMD_PART_INFO_REP_PBUILD_SIZE 8
    #define SI4455_CMD_PART_INFO_REP_PBUILD_MASK 0xFF
    #define SI4455_CMD_PART_INFO_REP_PBUILD_MSB  7
    #define SI4455_CMD_PART_INFO_REP_PBUILD_LSB  0
    #define SI4455_CMD_PART_INFO_REP_PBUILD_INDEX 4
    #define SI4455_CMD_PART_INFO_REP_ID_TYPE u16
    #define SI4455_CMD_PART_INFO_REP_ID_SIZE 16
    #define SI4455_CMD_PART_INFO_REP_ID_MASK 0xFFFF
    #define SI4455_CMD_PART_INFO_REP_ID_MSB  15
    #define SI4455_CMD_PART_INFO_REP_ID_LSB  0
    #define SI4455_CMD_PART_INFO_REP_ID_INDEX 5
    #define SI4455_CMD_PART_INFO_REP_CUSTOMER_TYPE u8
    #define SI4455_CMD_PART_INFO_REP_CUSTOMER_SIZE 8
    #define SI4455_CMD_PART_INFO_REP_CUSTOMER_MASK 0xFF
    #define SI4455_CMD_PART_INFO_REP_CUSTOMER_MSB  7
    #define SI4455_CMD_PART_INFO_REP_CUSTOMER_LSB  0
    #define SI4455_CMD_PART_INFO_REP_CUSTOMER_INDEX 7
    #define SI4455_CMD_PART_INFO_REP_ROMID_TYPE u8
    #define SI4455_CMD_PART_INFO_REP_ROMID_SIZE 8
    #define SI4455_CMD_PART_INFO_REP_ROMID_MASK 0xFF
    #define SI4455_CMD_PART_INFO_REP_ROMID_MSB  7
    #define SI4455_CMD_PART_INFO_REP_ROMID_LSB  0
    #define SI4455_CMD_PART_INFO_REP_ROMID_INDEX 8
    #define SI4455_CMD_PART_INFO_REP_BOND_TYPE u8
    #define SI4455_CMD_PART_INFO_REP_BOND_SIZE 8
    #define SI4455_CMD_PART_INFO_REP_BOND_MASK 0xFF
    #define SI4455_CMD_PART_INFO_REP_BOND_MSB  7
    #define SI4455_CMD_PART_INFO_REP_BOND_LSB  0
    #define SI4455_CMD_PART_INFO_REP_BOND_INDEX 9

#define SI4455_CMD_ID_POWER_UP                                                 0x02
//POWER_UP ARGS
#define SI4455_CMD_ARG_COUNT_POWER_UP                                          7
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_TYPE bitfield
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_SIZE 8
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_MASK 0xFF
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_MSB  7
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_LSB  0
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_INDEX 1
    #define SI4455_CMD_POWER_UP_ARG_BOOT_OPTIONS_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_POWER_UP_ARG_PATCH_TYPE bitfield
    #define SI4455_CMD_POWER_UP_ARG_PATCH_SIZE 1
    #define SI4455_CMD_POWER_UP_ARG_PATCH_MASK 0x80
    #define SI4455_CMD_POWER_UP_ARG_PATCH_BIT  0x80
    #define SI4455_CMD_POWER_UP_ARG_PATCH_MSB  7
    #define SI4455_CMD_POWER_UP_ARG_PATCH_LSB  7
    #define SI4455_CMD_POWER_UP_ARG_PATCH_INDEX 1
    #define SI4455_CMD_POWER_UP_ARG_PATCH_is_true (cmd.arg.RAW[1]&0x80)
    #define SI4455_CMD_POWER_UP_ARG_PATCH_value (((cmd.arg.RAW[1]&0x80))>>7)
    #define SI4455_CMD_POWER_UP_ARG_FUNC_TYPE bitfield
    #define SI4455_CMD_POWER_UP_ARG_FUNC_SIZE 6
    #define SI4455_CMD_POWER_UP_ARG_FUNC_MASK 0x3F
    #define SI4455_CMD_POWER_UP_ARG_FUNC_MSB  5
    #define SI4455_CMD_POWER_UP_ARG_FUNC_LSB  0
    #define SI4455_CMD_POWER_UP_ARG_FUNC_INDEX 1
    #define SI4455_CMD_POWER_UP_ARG_FUNC_value (((cmd.arg.RAW[1]&0x3F)))
    #define SI4455_CMD_POWER_UP_ARG_FUNC_ENUM_BOOT 0
    #define SI4455_CMD_POWER_UP_ARG_FUNC_ENUM_MAIN 1
    #define SI4455_CMD_POWER_UP_ARG_FUNC_ENUM_LOADED 63
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_TYPE bitfield
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_SIZE 8
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_MASK 0xFF
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_MSB  7
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_LSB  0
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_INDEX 2
    #define SI4455_CMD_POWER_UP_ARG_XTAL_OPTIONS_value (((cmd.arg.RAW[2])))
    #define SI4455_CMD_POWER_UP_ARG_TCXO_TYPE bitfield
    #define SI4455_CMD_POWER_UP_ARG_TCXO_SIZE 1
    #define SI4455_CMD_POWER_UP_ARG_TCXO_MASK 0x01
    #define SI4455_CMD_POWER_UP_ARG_TCXO_BIT  0x01
    #define SI4455_CMD_POWER_UP_ARG_TCXO_MSB  0
    #define SI4455_CMD_POWER_UP_ARG_TCXO_LSB  0
    #define SI4455_CMD_POWER_UP_ARG_TCXO_INDEX 2
    #define SI4455_CMD_POWER_UP_ARG_TCXO_is_true (cmd.arg.RAW[2]&0x1)
    #define SI4455_CMD_POWER_UP_ARG_TCXO_value (((cmd.arg.RAW[2]&0x1)))
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_TYPE u32
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_SIZE 32
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MASK 0xFFFFFFFF
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MSB  31
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_LSB  0
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_INDEX 3
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_value (((cmd.arg.RAW_u32[0])))
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MIN 25000000
    #define SI4455_CMD_POWER_UP_ARG_XO_FREQ_MAX 32000000
//POWER_UP REPLY
#define SI4455_CMD_REPLY_COUNT_POWER_UP                                        0

#define SI4455_CMD_ID_TEST_DATA                                                0x09
//TEST_DATA ARGS
#define SI4455_CMD_ARG_COUNT_TEST_DATA                                         2
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_TYPE u8
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_SIZE 8
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_MSB  7
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_LSB  0
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_INDEX 1
    #define SI4455_CMD_TEST_DATA_ARG_OFFSET_value (((cmd.arg.RAW[1])))
//TEST_DATA REPLY
#define SI4455_CMD_REPLY_COUNT_TEST_DATA                                       16
    #define SI4455_CMD_TEST_DATA_REP_TEST0_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST0_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST0_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST0_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST0_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST0_INDEX 1
    #define SI4455_CMD_TEST_DATA_REP_TEST1_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST1_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST1_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST1_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST1_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST1_INDEX 2
    #define SI4455_CMD_TEST_DATA_REP_TEST2_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST2_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST2_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST2_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST2_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST2_INDEX 3
    #define SI4455_CMD_TEST_DATA_REP_TEST3_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST3_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST3_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST3_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST3_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST3_INDEX 4
    #define SI4455_CMD_TEST_DATA_REP_TEST4_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST4_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST4_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST4_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST4_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST4_INDEX 5
    #define SI4455_CMD_TEST_DATA_REP_TEST5_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST5_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST5_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST5_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST5_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST5_INDEX 6
    #define SI4455_CMD_TEST_DATA_REP_TEST6_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST6_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST6_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST6_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST6_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST6_INDEX 7
    #define SI4455_CMD_TEST_DATA_REP_TEST7_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST7_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST7_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST7_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST7_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST7_INDEX 8
    #define SI4455_CMD_TEST_DATA_REP_TEST8_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST8_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST8_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST8_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST8_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST8_INDEX 9
    #define SI4455_CMD_TEST_DATA_REP_TEST9_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TEST9_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TEST9_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TEST9_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TEST9_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TEST9_INDEX 10
    #define SI4455_CMD_TEST_DATA_REP_TESTA_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TESTA_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TESTA_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TESTA_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TESTA_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TESTA_INDEX 11
    #define SI4455_CMD_TEST_DATA_REP_TESTB_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TESTB_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TESTB_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TESTB_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TESTB_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TESTB_INDEX 12
    #define SI4455_CMD_TEST_DATA_REP_TESTC_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TESTC_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TESTC_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TESTC_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TESTC_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TESTC_INDEX 13
    #define SI4455_CMD_TEST_DATA_REP_TESTD_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TESTD_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TESTD_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TESTD_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TESTD_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TESTD_INDEX 14
    #define SI4455_CMD_TEST_DATA_REP_TESTE_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TESTE_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TESTE_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TESTE_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TESTE_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TESTE_INDEX 15
    #define SI4455_CMD_TEST_DATA_REP_TESTF_TYPE u8
    #define SI4455_CMD_TEST_DATA_REP_TESTF_SIZE 8
    #define SI4455_CMD_TEST_DATA_REP_TESTF_MASK 0xFF
    #define SI4455_CMD_TEST_DATA_REP_TESTF_MSB  7
    #define SI4455_CMD_TEST_DATA_REP_TESTF_LSB  0
    #define SI4455_CMD_TEST_DATA_REP_TESTF_INDEX 16

