mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_CMD_ID_GPIO_PIN_CFG                                             0x13
//GPIO_PIN_CFG ARGS
#define SI4455_CMD_ARG_COUNT_GPIO_PIN_CFG                                      8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_INDEX 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_MASK 0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_BIT  0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_LSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_INDEX 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_is_true (cmd.arg.RAW[1]&0x40)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_value (((cmd.arg.RAW[1]&0x40))>>6)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_ENUM_PULL_DIS 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_PULL_CTL_ENUM_PULL_EN 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_INDEX 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_value (((cmd.arg.RAW[1]&0x3F)))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO0_MODE_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_INDEX 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_value (((cmd.arg.RAW[2])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_MASK 0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_BIT  0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_LSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_INDEX 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_is_true (cmd.arg.RAW[2]&0x40)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_value (((cmd.arg.RAW[2]&0x40))>>6)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_ENUM_PULL_DIS 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_PULL_CTL_ENUM_PULL_EN 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_INDEX 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_value (((cmd.arg.RAW[2]&0x3F)))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO1_MODE_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_INDEX 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_value (((cmd.arg.RAW[3])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_MASK 0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_BIT  0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_LSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_INDEX 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_is_true (cmd.arg.RAW[3]&0x40)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_value (((cmd.arg.RAW[3]&0x40))>>6)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_ENUM_PULL_DIS 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_PULL_CTL_ENUM_PULL_EN 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_INDEX 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_value (((cmd.arg.RAW[3]&0x3F)))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO2_MODE_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_INDEX 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_value (((cmd.arg.RAW[4])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_MASK 0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_BIT  0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_LSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_INDEX 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_is_true (cmd.arg.RAW[4]&0x40)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_value (((cmd.arg.RAW[4]&0x40))>>6)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_ENUM_PULL_DIS 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_PULL_CTL_ENUM_PULL_EN 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_INDEX 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_value (((cmd.arg.RAW[4]&0x3F)))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GPIO3_MODE_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_INDEX 5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_value (((cmd.arg.RAW[5])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_MASK 0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_BIT  0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_LSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_INDEX 5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_is_true (cmd.arg.RAW[5]&0x40)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_value (((cmd.arg.RAW[5]&0x40))>>6)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_ENUM_PULL_DIS 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_DRV_PULL_ENUM_PULL_EN 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_INDEX 5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_value (((cmd.arg.RAW[5]&0x3F)))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_NIRQ_MODE_ENUM_NIRQ 39
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_INDEX 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_value (((cmd.arg.RAW[6])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_MASK 0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_BIT  0x40
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_LSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_INDEX 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_is_true (cmd.arg.RAW[6]&0x40)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_value (((cmd.arg.RAW[6]&0x40))>>6)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_ENUM_PULL_DIS 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_PULL_CTL_ENUM_PULL_EN 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_INDEX 6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_value (((cmd.arg.RAW[6]&0x3F)))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_SDO_MODE_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_INDEX 7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_GEN_CONFIG_value (((cmd.arg.RAW[7])))
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_SIZE 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_MASK 0x60
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_LSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_INDEX 7
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_value (((cmd.arg.RAW[7]&0x60))>>5)
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_ENUM_HIGH 0
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_ENUM_MED_HIGH 1
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_ENUM_MED_LOW 2
    #define SI4455_CMD_GPIO_PIN_CFG_ARG_DRV_STRENGTH_ENUM_LOW 3
//GPIO_PIN_CFG REPLY
#define SI4455_CMD_REPLY_COUNT_GPIO_PIN_CFG                                    7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_INDEX 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_MASK 0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_BIT  0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_LSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0_STATE_INDEX 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_INDEX 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO0R_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_INDEX 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_MASK 0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_BIT  0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_LSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1_STATE_INDEX 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_INDEX 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO1R_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_INDEX 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_MASK 0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_BIT  0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_LSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2_STATE_INDEX 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_INDEX 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_DATA_CLK 16
