mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO2R_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3_INDEX 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_MASK 0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_BIT  0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_LSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3STATE_INDEX 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_INDEX 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_STATE 32
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_STATE 33
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_RX_FIFO_FULL 34
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GPIO3R_ENUM_TX_FIFO_EMPTY 35
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQ_INDEX 5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_MASK 0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_BIT  0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_LSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQSTATE_INDEX 5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_INDEX 5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_REP_NIRQR_ENUM_NIRQ 39
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDO_INDEX 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_SIZE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_MASK 0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_BIT  0x80
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_LSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOSTATE_INDEX 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_SIZE 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_MASK 0x3F
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_MSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_INDEX 6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DONOTHING 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TRISTATE 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DRIVE0 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_DRIVE1 3
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_INPUT 4
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_SDO 11
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_POR 12
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TX_DATA_CLK 16
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_DATA_CLK 17
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_TX_DATA 19
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_DATA 20
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_RX_RAW_DATA 21
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_VALID_PREAMBLE 24
    #define SI4455_CMD_GPIO_PIN_CFG_REP_SDOR_ENUM_SYNC_WORD_DETECT 26
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_SIZE 8
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_MASK 0xFF
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_MSB  7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_LSB  0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_GEN_CONFIG_INDEX 7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_TYPE bitfield
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_SIZE 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_MASK 0x60
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_MSB  6
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_LSB  5
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_INDEX 7
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_HIGH 0
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_MED_HIGH 1
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_MED_LOW 2
    #define SI4455_CMD_GPIO_PIN_CFG_REP_DRV_STRENGTH_ENUM_LOW 3

