mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_CMD_ID_GET_ADC_READING                                          0x14
//GET_ADC_READING ARGS
#define SI4455_CMD_ARG_COUNT_GET_ADC_READING                                   3
//GET_ADC_READING REPLY
#define SI4455_CMD_REPLY_COUNT_GET_ADC_READING                                 8

#define SI4455_CMD_ID_FIFO_INFO                                                0x15
//FIFO_INFO ARGS
#define SI4455_CMD_ARG_COUNT_FIFO_INFO                                         2
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_TYPE bitfield
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_SIZE 8
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_MASK 0xFF
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_MSB  7
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_LSB  0
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_INDEX 1
    #define SI4455_CMD_FIFO_INFO_ARG_FIFO_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_FIFO_INFO_ARG_RX_TYPE bitfield
    #define SI4455_CMD_FIFO_INFO_ARG_RX_SIZE 1
    #define SI4455_CMD_FIFO_INFO_ARG_RX_MASK 0x02
    #define SI4455_CMD_FIFO_INFO_ARG_RX_BIT  0x02
    #define SI4455_CMD_FIFO_INFO_ARG_RX_MSB  1
    #define SI4455_CMD_FIFO_INFO_ARG_RX_LSB  1
    #define SI4455_CMD_FIFO_INFO_ARG_RX_INDEX 1
    #define SI4455_CMD_FIFO_INFO_ARG_RX_is_true (cmd.arg.RAW[1]&0x2)
    #define SI4455_CMD_FIFO_INFO_ARG_RX_value (((cmd.arg.RAW[1]&0x2))>>1)
    #define SI4455_CMD_FIFO_INFO_ARG_RX_ENUM_FALSE 0
    #define SI4455_CMD_FIFO_INFO_ARG_RX_ENUM_TRUE 1
    #define SI4455_CMD_FIFO_INFO_ARG_TX_TYPE bitfield
    #define SI4455_CMD_FIFO_INFO_ARG_TX_SIZE 1
    #define SI4455_CMD_FIFO_INFO_ARG_TX_MASK 0x01
    #define SI4455_CMD_FIFO_INFO_ARG_TX_BIT  0x01
    #define SI4455_CMD_FIFO_INFO_ARG_TX_MSB  0
    #define SI4455_CMD_FIFO_INFO_ARG_TX_LSB  0
    #define SI4455_CMD_FIFO_INFO_ARG_TX_INDEX 1
    #define SI4455_CMD_FIFO_INFO_ARG_TX_is_true (cmd.arg.RAW[1]&0x1)
    #define SI4455_CMD_FIFO_INFO_ARG_TX_value (((cmd.arg.RAW[1]&0x1)))
    #define SI4455_CMD_FIFO_INFO_ARG_TX_ENUM_FALSE 0
    #define SI4455_CMD_FIFO_INFO_ARG_TX_ENUM_TRUE 1
//FIFO_INFO REPLY
#define SI4455_CMD_REPLY_COUNT_FIFO_INFO                                       2
    #define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_TYPE u8
    #define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_SIZE 8
    #define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_MASK 0xFF
    #define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_MSB  7
    #define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_LSB  0
    #define SI4455_CMD_FIFO_INFO_REP_RX_FIFO_COUNT_INDEX 1
    #define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_TYPE u8
    #define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_SIZE 8
    #define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_MASK 0xFF
    #define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_MSB  7
    #define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_LSB  0
    #define SI4455_CMD_FIFO_INFO_REP_TX_FIFO_SPACE_INDEX 2

#define SI4455_CMD_ID_EZCONFIG_CHECK                                           0x19
//EZCONFIG_CHECK ARGS
#define SI4455_CMD_ARG_COUNT_EZCONFIG_CHECK                                    3
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_TYPE u16
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_SIZE 16
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_MASK 0xFFFF
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_MSB  15
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_LSB  0
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_INDEX 1
    #define SI4455_CMD_EZCONFIG_CHECK_ARG_CHECKSUM_value (((cmd.arg.RAW_u16[0])))
//EZCONFIG_CHECK REPLY
#define SI4455_CMD_REPLY_COUNT_EZCONFIG_CHECK                                  1
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_TYPE u8
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_SIZE 8
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_MASK 0xFF
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_MSB  7
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_LSB  0
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_INDEX 1
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_ENUM_VALID 0
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_ENUM_BAD_CHECKSUM 1
    #define SI4455_CMD_EZCONFIG_CHECK_REP_RESULT_ENUM_INVALID_STATE 2

#define SI4455_CMD_ID_GET_INT_STATUS                                           0x20
//GET_INT_STATUS ARGS
#define SI4455_CMD_ARG_COUNT_GET_INT_STATUS                                    4
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PH_CLR_PEND_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_is_true (cmd.arg.RAW[1]&0x20)
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_SENT_PEND_CLR_value (((cmd.arg.RAW[1]&0x20))>>5)
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_is_true (cmd.arg.RAW[1]&0x10)
    #define SI4455_CMD_GET_INT_STATUS_ARG_PACKET_RX_PEND_CLR_value (((cmd.arg.RAW[1]&0x10))>>4)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_is_true (cmd.arg.RAW[1]&0x8)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CRC_ERROR_PEND_CLR_value (((cmd.arg.RAW[1]&0x8))>>3)
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_is_true (cmd.arg.RAW[1]&0x2)
    #define SI4455_CMD_GET_INT_STATUS_ARG_TX_FIFO_ALMOST_EMPTY_PEND_CLR_value (((cmd.arg.RAW[1]&0x2))>>1)
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_is_true (cmd.arg.RAW[1]&0x1)
    #define SI4455_CMD_GET_INT_STATUS_ARG_RX_FIFO_ALMOST_FULL_PEND_CLR_value (((cmd.arg.RAW[1]&0x1)))
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_MODEM_CLR_PEND_value (((cmd.arg.RAW[2])))
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_MASK 0x40
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_BIT  0x40
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_MSB  6
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_LSB  6
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_is_true (cmd.arg.RAW[2]&0x40)
    #define SI4455_CMD_GET_INT_STATUS_ARG_POSTAMBLE_DETECT_PEND_CLR_value (((cmd.arg.RAW[2]&0x40))>>6)
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_is_true (cmd.arg.RAW[2]&0x20)
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_SYNC_PEND_CLR_value (((cmd.arg.RAW[2]&0x20))>>5)
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_is_true (cmd.arg.RAW[2]&0x10)
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_JUMP_PEND_CLR_value (((cmd.arg.RAW[2]&0x10))>>4)
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_is_true (cmd.arg.RAW[2]&0x8)
    #define SI4455_CMD_GET_INT_STATUS_ARG_RSSI_PEND_CLR_value (((cmd.arg.RAW[2]&0x8))>>3)
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_is_true (cmd.arg.RAW[2]&0x4)
    #define SI4455_CMD_GET_INT_STATUS_ARG_INVALID_PREAMBLE_PEND_CLR_value (((cmd.arg.RAW[2]&0x4))>>2)
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_is_true (cmd.arg.RAW[2]&0x2)
    #define SI4455_CMD_GET_INT_STATUS_ARG_PREAMBLE_DETECT_PEND_CLR_value (((cmd.arg.RAW[2]&0x2))>>1)
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_is_true (cmd.arg.RAW[2]&0x1)
    #define SI4455_CMD_GET_INT_STATUS_ARG_SYNC_DETECT_PEND_CLR_value (((cmd.arg.RAW[2]&0x1)))
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_CLR_PEND_value (((cmd.arg.RAW[3])))
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_MASK 0x40
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_BIT  0x40
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_MSB  6
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_LSB  6
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_is_true (cmd.arg.RAW[3]&0x40)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CAL_PEND_CLR_value (((cmd.arg.RAW[3]&0x40))>>6)
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_is_true (cmd.arg.RAW[3]&0x20)
    #define SI4455_CMD_GET_INT_STATUS_ARG_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_CLR_value (((cmd.arg.RAW[3]&0x20))>>5)
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_is_true (cmd.arg.RAW[3]&0x10)
    #define SI4455_CMD_GET_INT_STATUS_ARG_STATE_CHANGE_PEND_CLR_value (((cmd.arg.RAW[3]&0x10))>>4)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_is_true (cmd.arg.RAW[3]&0x8)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CMD_ERROR_PEND_CLR_value (((cmd.arg.RAW[3]&0x8))>>3)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_is_true (cmd.arg.RAW[3]&0x4)
    #define SI4455_CMD_GET_INT_STATUS_ARG_CHIP_READY_PEND_CLR_value (((cmd.arg.RAW[3]&0x4))>>2)
//GET_INT_STATUS REPLY
#define SI4455_CMD_REPLY_COUNT_GET_INT_STATUS                                  8
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_PEND_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_PEND_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_PEND_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_PEND_INDEX 1
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_STATUS_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_STATUS_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_STATUS_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_STATUS_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_INT_STATUS_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_INT_STATUS_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_INT_STATUS_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_INT_STATUS_INDEX 2
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_SIZE 1
