mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_PEND_INDEX 3
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_STATUS_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_STATUS_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_STATUS_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_STATUS_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_PH_STATUS_INDEX 4
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_SENT_INDEX 4
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_PACKET_RX_INDEX 4
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CRC_ERROR_INDEX 4
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_TX_FIFO_ALMOST_EMPTY_INDEX 4
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_RX_FIFO_ALMOST_FULL_INDEX 4
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_MASK 0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_BIT  0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_MSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_LSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_PEND_INDEX 5
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_STATUS_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_STATUS_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_STATUS_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_STATUS_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_MODEM_STATUS_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_MASK 0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_BIT  0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_MSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_LSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_POSTAMBLE_DETECT_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_SYNC_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_JUMP_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_RSSI_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_INVALID_PREAMBLE_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_MASK 0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_BIT  0x02
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_MSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_LSB  1
    #define SI4455_CMD_GET_INT_STATUS_REP_PREAMBLE_DETECT_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_MASK 0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_BIT  0x01
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_MSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_SYNC_DETECT_INDEX 6
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_PEND_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_PEND_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_PEND_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_PEND_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_PEND_INDEX 7
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_MASK 0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_BIT  0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_MSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_LSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_PEND_INDEX 7
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_INDEX 7
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_PEND_INDEX 7
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_PEND_INDEX 7
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_PEND_INDEX 7
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_STATUS_SIZE 8
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_STATUS_MASK 0xFF
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_STATUS_MSB  7
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_STATUS_LSB  0
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_STATUS_INDEX 8
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_MASK 0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_BIT  0x40
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_MSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_LSB  6
    #define SI4455_CMD_GET_INT_STATUS_REP_CAL_INDEX 8
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_MASK 0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_BIT  0x20
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_MSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_LSB  5
    #define SI4455_CMD_GET_INT_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_INDEX 8
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_MASK 0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_BIT  0x10
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_MSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_LSB  4
    #define SI4455_CMD_GET_INT_STATUS_REP_STATE_CHANGE_INDEX 8
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_MASK 0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_BIT  0x08
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_MSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_LSB  3
    #define SI4455_CMD_GET_INT_STATUS_REP_CMD_ERROR_INDEX 8
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_TYPE bitfield
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_SIZE 1
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_MASK 0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_BIT  0x04
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_MSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_LSB  2
    #define SI4455_CMD_GET_INT_STATUS_REP_CHIP_READY_INDEX 8


