mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
//GET_CHIP_STATUS REPLY
#define SI4455_CMD_REPLY_COUNT_GET_CHIP_STATUS                                 3
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_SIZE 8
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_MASK 0xFF
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_MSB  7
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_LSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_MASK 0x40
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_BIT  0x40
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_MSB  6
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_LSB  6
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_MASK 0x20
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_BIT  0x20
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_MSB  5
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_LSB  5
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_MASK 0x10
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_BIT  0x10
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_MSB  4
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_LSB  4
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_MASK 0x08
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_BIT  0x08
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_MSB  3
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_LSB  3
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_MASK 0x04
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_BIT  0x04
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_MSB  2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_LSB  2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_MASK 0x02
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_BIT  0x02
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_MSB  1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_LSB  1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_MASK 0x01
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_BIT  0x01
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_MSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_LSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_PEND_INDEX 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_SIZE 8
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_MASK 0xFF
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_MSB  7
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_LSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_STATUS_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_MASK 0x40
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_BIT  0x40
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_MSB  6
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_LSB  6
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CAL_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_MASK 0x20
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_BIT  0x20
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_MSB  5
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_LSB  5
    #define SI4455_CMD_GET_CHIP_STATUS_REP_FIFO_UNDERFLOW_OVERFLOW_ERROR_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_MASK 0x10
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_BIT  0x10
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_MSB  4
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_LSB  4
    #define SI4455_CMD_GET_CHIP_STATUS_REP_STATE_CHANGE_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_MASK 0x08
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_BIT  0x08
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_MSB  3
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_LSB  3
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERROR_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_MASK 0x04
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_BIT  0x04
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_MSB  2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_LSB  2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CHIP_READY_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_MASK 0x02
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_BIT  0x02
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_MSB  1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_LSB  1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_LOW_BATT_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_TYPE bitfield
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_SIZE 1
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_MASK 0x01
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_BIT  0x01
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_MSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_LSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_WUT_INDEX 2
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_TYPE u8
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_SIZE 8
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_MASK 0xFF
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_MSB  7
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_LSB  0
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_INDEX 3
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_NONE 0x00
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_COMMAND 0x10
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_ARG 0x11
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_COMMAND_BUSY 0x12
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_NVM 0x20
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_PATCH 0x30
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_BOOTMODE 0x31
    #define SI4455_CMD_GET_CHIP_STATUS_REP_CMD_ERR_STATUS_ENUM_CMD_ERROR_BAD_PROPERTY 0x40

