mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_CMD_ID_GET_PH_STATUS                                           0x21
//GET_PH_STATUS ARGS
#define SI4455_CMD_ARG_COUNT_GET_PH_STATUS                                     2
//GET_PH_STATUS REPLY
#define SI4455_CMD_REPLY_COUNT_GET_PH_STATUS                                   2

#define SI4455_CMD_ID_GET_MODEM_STATUS                                         0x22
//GET_MODEM_STATUS ARGS
#define SI4455_CMD_ARG_COUNT_GET_MODEM_STATUS                                  2
//GET_MODEM_STATUS REPLY
#define SI4455_CMD_REPLY_COUNT_GET_MODEM_STATUS                                8

#define SI4455_CMD_ID_GET_CHIP_STATUS                                          0x23
//GET_CHIP_STATUS ARGS
#define SI4455_CMD_ARG_COUNT_GET_CHIP_STATUS                                   2
//GET_CHIP_STATUS REPLY
#define SI4455_CMD_REPLY_COUNT_GET_CHIP_STATUS                                 3

#define SI4455_CMD_ID_START_TX                                                 0x31
//START_TX ARGS
#define SI4455_CMD_ARG_COUNT_START_TX                                          5
    #define SI4455_CMD_START_TX_ARG_CHANNEL_TYPE u8
    #define SI4455_CMD_START_TX_ARG_CHANNEL_SIZE 8
    #define SI4455_CMD_START_TX_ARG_CHANNEL_MASK 0xFF
    #define SI4455_CMD_START_TX_ARG_CHANNEL_MSB  7
    #define SI4455_CMD_START_TX_ARG_CHANNEL_LSB  0
    #define SI4455_CMD_START_TX_ARG_CHANNEL_INDEX 1
    #define SI4455_CMD_START_TX_ARG_CHANNEL_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_START_TX_ARG_CHANNEL_MIN 0
    #define SI4455_CMD_START_TX_ARG_CHANNEL_MAX 255
    #define SI4455_CMD_START_TX_ARG_CONDITION_TYPE bitfield
    #define SI4455_CMD_START_TX_ARG_CONDITION_SIZE 8
    #define SI4455_CMD_START_TX_ARG_CONDITION_MASK 0xFF
    #define SI4455_CMD_START_TX_ARG_CONDITION_MSB  7
    #define SI4455_CMD_START_TX_ARG_CONDITION_LSB  0
    #define SI4455_CMD_START_TX_ARG_CONDITION_INDEX 2
    #define SI4455_CMD_START_TX_ARG_CONDITION_value (((cmd.arg.RAW[2])))
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_TYPE bitfield
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_SIZE 4
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_MASK 0xF0
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_MSB  7
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_LSB  4
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_INDEX 2
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_value (((cmd.arg.RAW[2]&0xF0))>>4)
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_NOCHANGE 0
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_SLEEP 1
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_SPI_ACTIVE 2
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_READY 3
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_READY2 4
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_TX_TUNE 5
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_RX_TUNE 6
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_TX 7
    #define SI4455_CMD_START_TX_ARG_TXCOMPLETE_STATE_ENUM_RX 8
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_TYPE bitfield
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_SIZE 1
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_MASK 0x04
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_BIT  0x04
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_MSB  2
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_LSB  2
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_INDEX 2
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_is_true (cmd.arg.RAW[2]&0x4)
    #define SI4455_CMD_START_TX_ARG_RETRANSMIT_value (((cmd.arg.RAW[2]&0x4))>>2)
    #define SI4455_CMD_START_TX_ARG_START_TYPE bitfield
    #define SI4455_CMD_START_TX_ARG_START_SIZE 2
    #define SI4455_CMD_START_TX_ARG_START_MASK 0x03
    #define SI4455_CMD_START_TX_ARG_START_MSB  1
    #define SI4455_CMD_START_TX_ARG_START_LSB  0
    #define SI4455_CMD_START_TX_ARG_START_INDEX 2
    #define SI4455_CMD_START_TX_ARG_START_value (((cmd.arg.RAW[2]&0x3)))
    #define SI4455_CMD_START_TX_ARG_TX_LEN_TYPE u16
    #define SI4455_CMD_START_TX_ARG_TX_LEN_SIZE 16
    #define SI4455_CMD_START_TX_ARG_TX_LEN_MASK 0xFFFF
    #define SI4455_CMD_START_TX_ARG_TX_LEN_MSB  15
    #define SI4455_CMD_START_TX_ARG_TX_LEN_LSB  0
    #define SI4455_CMD_START_TX_ARG_TX_LEN_INDEX 3
    #define SI4455_CMD_START_TX_ARG_TX_LEN_value (((cmd.arg.RAW_u16[1])))
    #define SI4455_CMD_START_TX_ARG_TX_LEN_MIN 0
    #define SI4455_CMD_START_TX_ARG_TX_LEN_MAX 8191
//START_TX REPLY
#define SI4455_CMD_REPLY_COUNT_START_TX                                        0

#define SI4455_CMD_ID_START_RX                                                 0x32
//START_RX ARGS
#define SI4455_CMD_ARG_COUNT_START_RX                                          8
    #define SI4455_CMD_START_RX_ARG_CHANNEL_TYPE u8
    #define SI4455_CMD_START_RX_ARG_CHANNEL_SIZE 8
    #define SI4455_CMD_START_RX_ARG_CHANNEL_MASK 0xFF
    #define SI4455_CMD_START_RX_ARG_CHANNEL_MSB  7
    #define SI4455_CMD_START_RX_ARG_CHANNEL_LSB  0
    #define SI4455_CMD_START_RX_ARG_CHANNEL_INDEX 1
    #define SI4455_CMD_START_RX_ARG_CHANNEL_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_START_RX_ARG_CHANNEL_MIN 0
    #define SI4455_CMD_START_RX_ARG_CHANNEL_MAX 255
    #define SI4455_CMD_START_RX_ARG_CONDITION_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_CONDITION_SIZE 8
    #define SI4455_CMD_START_RX_ARG_CONDITION_MASK 0xFF
    #define SI4455_CMD_START_RX_ARG_CONDITION_MSB  7
    #define SI4455_CMD_START_RX_ARG_CONDITION_LSB  0
    #define SI4455_CMD_START_RX_ARG_CONDITION_INDEX 2
    #define SI4455_CMD_START_RX_ARG_CONDITION_value (((cmd.arg.RAW[2])))
    #define SI4455_CMD_START_RX_ARG_START_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_START_SIZE 1
    #define SI4455_CMD_START_RX_ARG_START_MASK 0x01
    #define SI4455_CMD_START_RX_ARG_START_BIT  0x01
    #define SI4455_CMD_START_RX_ARG_START_MSB  0
    #define SI4455_CMD_START_RX_ARG_START_LSB  0
    #define SI4455_CMD_START_RX_ARG_START_INDEX 2
    #define SI4455_CMD_START_RX_ARG_START_is_true (cmd.arg.RAW[2]&0x1)
    #define SI4455_CMD_START_RX_ARG_START_value (((cmd.arg.RAW[2]&0x1)))
    #define SI4455_CMD_START_RX_ARG_RX_LEN_TYPE u16
    #define SI4455_CMD_START_RX_ARG_RX_LEN_SIZE 16
    #define SI4455_CMD_START_RX_ARG_RX_LEN_MASK 0xFFFF
    #define SI4455_CMD_START_RX_ARG_RX_LEN_MSB  15
    #define SI4455_CMD_START_RX_ARG_RX_LEN_LSB  0
    #define SI4455_CMD_START_RX_ARG_RX_LEN_INDEX 3
    #define SI4455_CMD_START_RX_ARG_RX_LEN_value (((cmd.arg.RAW_u16[1])))
    #define SI4455_CMD_START_RX_ARG_RX_LEN_MIN 0
    #define SI4455_CMD_START_RX_ARG_RX_LEN_MAX 8191
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_SIZE 8
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_MASK 0xFF
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_MSB  7
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_LSB  0
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_INDEX 5
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE1_value (((cmd.arg.RAW[5])))
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_SIZE 4
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_MASK 0x0F
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_MSB  3
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_LSB  0
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_INDEX 5
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_value (((cmd.arg.RAW[5]&0xF)))
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_NOCHANGE 0
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_SLEEP 1
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_SPI_ACTIVE 2
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_READY 3
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_READY2 4
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_TX_TUNE 5
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_RX_TUNE 6
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_TX 7
    #define SI4455_CMD_START_RX_ARG_RXTIMEOUT_STATE_ENUM_RX 8
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_SIZE 8
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_MASK 0xFF
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_MSB  7
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_LSB  0
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_INDEX 6
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE2_value (((cmd.arg.RAW[6])))
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_SIZE 4
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_MASK 0x0F
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_MSB  3
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_LSB  0
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_INDEX 6
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_value (((cmd.arg.RAW[6]&0xF)))
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_NOCHANGE 0
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_SLEEP 1
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_SPI_ACTIVE 2
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_READY 3
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_READY2 4
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_TX_TUNE 5
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_RX_TUNE 6
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_TX 7
    #define SI4455_CMD_START_RX_ARG_RXVALID_STATE_ENUM_RX 8
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_SIZE 8
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_MASK 0xFF
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_MSB  7
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_LSB  0
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_INDEX 7
    #define SI4455_CMD_START_RX_ARG_NEXT_STATE3_value (((cmd.arg.RAW[7])))
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_TYPE bitfield
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_SIZE 4
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_MASK 0x0F
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_MSB  3
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_LSB  0
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_INDEX 7
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_value (((cmd.arg.RAW[7]&0xF)))
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_NOCHANGE 0
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_SLEEP 1
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_SPI_ACTIVE 2
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_READY 3
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_READY2 4
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_TX_TUNE 5
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_RX_TUNE 6
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_TX 7
    #define SI4455_CMD_START_RX_ARG_RXINVALID_STATE_ENUM_RX 8
//START_RX REPLY
#define SI4455_CMD_REPLY_COUNT_START_RX                                        0

#define SI4455_CMD_ID_REQUEST_DEVICE_STATE                                     0x33
//REQUEST_DEVICE_STATE ARGS
#define SI4455_CMD_ARG_COUNT_REQUEST_DEVICE_STATE                              1
//REQUEST_DEVICE_STATE REPLY
#define SI4455_CMD_REPLY_COUNT_REQUEST_DEVICE_STATE                            2
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_TYPE bitfield
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_SIZE 8
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_MASK 0xFF
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_MSB  7
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_LSB  0
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURR_STATE_INDEX 1
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_TYPE bitfield
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_SIZE 4
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_MASK 0x0F
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_MSB  3
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_LSB  0
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_INDEX 1
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_NOCHANGE 0
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_SLEEP 1
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_SPI_ACTIVE 2
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_READY 3
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_READY2 4
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_TX_TUNE 5
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_RX_TUNE 6
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_TX 7
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_MAIN_STATE_ENUM_RX 8
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_TYPE u8
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_SIZE 8
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_MASK 0xFF
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_MSB  7
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_LSB  0
    #define SI4455_CMD_REQUEST_DEVICE_STATE_REP_CURRENT_CHANNEL_INDEX 2

#define SI4455_CMD_ID_CHANGE_STATE                                             0x34
//CHANGE_STATE ARGS
#define SI4455_CMD_ARG_COUNT_CHANGE_STATE                                      2
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_TYPE bitfield
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_SIZE 8
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_MASK 0xFF
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_MSB  7
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_LSB  0
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_INDEX 1
    #define SI4455_CMD_CHANGE_STATE_ARG_NEXT_STATE1_value (((cmd.arg.RAW[1])))
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_TYPE bitfield
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_SIZE 4
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_MASK 0x0F
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_MSB  3
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_LSB  0
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_INDEX 1
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_value (((cmd.arg.RAW[1]&0xF)))
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_NOCHANGE 0
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_SLEEP 1
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_SPI_ACTIVE 2
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_READY 3
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_READY2 4
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_TX_TUNE 5
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_RX_TUNE 6
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_TX 7
    #define SI4455_CMD_CHANGE_STATE_ARG_NEW_STATE_ENUM_RX 8
//CHANGE_STATE REPLY
#define SI4455_CMD_REPLY_COUNT_CHANGE_STATE                                    0

#define SI4455_CMD_ID_READ_CMD_BUFF                                            0x44
//READ_CMD_BUFF ARGS
#define SI4455_CMD_ARG_COUNT_READ_CMD_BUFF                                     1
//READ_CMD_BUFF REPLY
#define SI4455_CMD_REPLY_COUNT_READ_CMD_BUFF                                   16
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF0_INDEX 1
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF1_INDEX 2
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF2_INDEX 3
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF3_INDEX 4
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF4_INDEX 5
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF5_INDEX 6
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF6_INDEX 7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF7_INDEX 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF8_INDEX 9
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF9_INDEX 10
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF10_INDEX 11
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF11_INDEX 12
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF12_INDEX 13
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF13_INDEX 14
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF14_INDEX 15
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_TYPE u8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_SIZE 8
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_MASK 0xFF
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_MSB  7
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_LSB  0
    #define SI4455_CMD_READ_CMD_BUFF_REP_CMD_BUFF15_INDEX 16

