mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_CMD_ID_FRR_A_READ                                               0x50
//FRR_A_READ ARGS
#define SI4455_CMD_ARG_COUNT_FRR_A_READ                                        1
//FRR_A_READ REPLY
#define SI4455_CMD_REPLY_COUNT_FRR_A_READ                                      3
    #define SI4455_CMD_FRR_A_READ_REP_FRR_B_VALUE_TYPE u8
    #define SI4455_CMD_FRR_A_READ_REP_FRR_B_VALUE_SIZE 8
    #define SI4455_CMD_FRR_A_READ_REP_FRR_B_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_A_READ_REP_FRR_B_VALUE_MSB  7
    #define SI4455_CMD_FRR_A_READ_REP_FRR_B_VALUE_LSB  0
    #define SI4455_CMD_FRR_A_READ_REP_FRR_B_VALUE_INDEX 1
    #define SI4455_CMD_FRR_A_READ_REP_FRR_C_VALUE_TYPE u8
    #define SI4455_CMD_FRR_A_READ_REP_FRR_C_VALUE_SIZE 8
    #define SI4455_CMD_FRR_A_READ_REP_FRR_C_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_A_READ_REP_FRR_C_VALUE_MSB  7
    #define SI4455_CMD_FRR_A_READ_REP_FRR_C_VALUE_LSB  0
    #define SI4455_CMD_FRR_A_READ_REP_FRR_C_VALUE_INDEX 2
    #define SI4455_CMD_FRR_A_READ_REP_FRR_D_VALUE_TYPE u8
    #define SI4455_CMD_FRR_A_READ_REP_FRR_D_VALUE_SIZE 8
    #define SI4455_CMD_FRR_A_READ_REP_FRR_D_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_A_READ_REP_FRR_D_VALUE_MSB  7
    #define SI4455_CMD_FRR_A_READ_REP_FRR_D_VALUE_LSB  0
    #define SI4455_CMD_FRR_A_READ_REP_FRR_D_VALUE_INDEX 3

#define SI4455_CMD_ID_FRR_B_READ                                               0x51
//FRR_B_READ ARGS
#define SI4455_CMD_ARG_COUNT_FRR_B_READ                                        1
//FRR_B_READ REPLY
#define SI4455_CMD_REPLY_COUNT_FRR_B_READ                                      3
    #define SI4455_CMD_FRR_B_READ_REP_FRR_C_VALUE_TYPE u8
    #define SI4455_CMD_FRR_B_READ_REP_FRR_C_VALUE_SIZE 8
    #define SI4455_CMD_FRR_B_READ_REP_FRR_C_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_B_READ_REP_FRR_C_VALUE_MSB  7
    #define SI4455_CMD_FRR_B_READ_REP_FRR_C_VALUE_LSB  0
    #define SI4455_CMD_FRR_B_READ_REP_FRR_C_VALUE_INDEX 1
    #define SI4455_CMD_FRR_B_READ_REP_FRR_D_VALUE_TYPE u8
    #define SI4455_CMD_FRR_B_READ_REP_FRR_D_VALUE_SIZE 8
    #define SI4455_CMD_FRR_B_READ_REP_FRR_D_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_B_READ_REP_FRR_D_VALUE_MSB  7
    #define SI4455_CMD_FRR_B_READ_REP_FRR_D_VALUE_LSB  0
    #define SI4455_CMD_FRR_B_READ_REP_FRR_D_VALUE_INDEX 2
    #define SI4455_CMD_FRR_B_READ_REP_FRR_A_VALUE_TYPE u8
    #define SI4455_CMD_FRR_B_READ_REP_FRR_A_VALUE_SIZE 8
    #define SI4455_CMD_FRR_B_READ_REP_FRR_A_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_B_READ_REP_FRR_A_VALUE_MSB  7
    #define SI4455_CMD_FRR_B_READ_REP_FRR_A_VALUE_LSB  0
    #define SI4455_CMD_FRR_B_READ_REP_FRR_A_VALUE_INDEX 3

#define SI4455_CMD_ID_FRR_C_READ                                               0x53
//FRR_C_READ ARGS
#define SI4455_CMD_ARG_COUNT_FRR_C_READ                                        1
//FRR_C_READ REPLY
#define SI4455_CMD_REPLY_COUNT_FRR_C_READ                                      3
    #define SI4455_CMD_FRR_C_READ_REP_FRR_D_VALUE_TYPE u8
    #define SI4455_CMD_FRR_C_READ_REP_FRR_D_VALUE_SIZE 8
    #define SI4455_CMD_FRR_C_READ_REP_FRR_D_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_C_READ_REP_FRR_D_VALUE_MSB  7
    #define SI4455_CMD_FRR_C_READ_REP_FRR_D_VALUE_LSB  0
    #define SI4455_CMD_FRR_C_READ_REP_FRR_D_VALUE_INDEX 1
    #define SI4455_CMD_FRR_C_READ_REP_FRR_A_VALUE_TYPE u8
    #define SI4455_CMD_FRR_C_READ_REP_FRR_A_VALUE_SIZE 8
    #define SI4455_CMD_FRR_C_READ_REP_FRR_A_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_C_READ_REP_FRR_A_VALUE_MSB  7
    #define SI4455_CMD_FRR_C_READ_REP_FRR_A_VALUE_LSB  0
    #define SI4455_CMD_FRR_C_READ_REP_FRR_A_VALUE_INDEX 2
    #define SI4455_CMD_FRR_C_READ_REP_FRR_B_VALUE_TYPE u8
    #define SI4455_CMD_FRR_C_READ_REP_FRR_B_VALUE_SIZE 8
    #define SI4455_CMD_FRR_C_READ_REP_FRR_B_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_C_READ_REP_FRR_B_VALUE_MSB  7
    #define SI4455_CMD_FRR_C_READ_REP_FRR_B_VALUE_LSB  0
    #define SI4455_CMD_FRR_C_READ_REP_FRR_B_VALUE_INDEX 3

#define SI4455_CMD_ID_FRR_D_READ                                               0x57
//FRR_D_READ ARGS
#define SI4455_CMD_ARG_COUNT_FRR_D_READ                                        1
//FRR_D_READ REPLY
#define SI4455_CMD_REPLY_COUNT_FRR_D_READ                                      3
    #define SI4455_CMD_FRR_D_READ_REP_FRR_A_VALUE_TYPE u8
    #define SI4455_CMD_FRR_D_READ_REP_FRR_A_VALUE_SIZE 8
    #define SI4455_CMD_FRR_D_READ_REP_FRR_A_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_D_READ_REP_FRR_A_VALUE_MSB  7
    #define SI4455_CMD_FRR_D_READ_REP_FRR_A_VALUE_LSB  0
    #define SI4455_CMD_FRR_D_READ_REP_FRR_A_VALUE_INDEX 1
    #define SI4455_CMD_FRR_D_READ_REP_FRR_B_VALUE_TYPE u8
    #define SI4455_CMD_FRR_D_READ_REP_FRR_B_VALUE_SIZE 8
    #define SI4455_CMD_FRR_D_READ_REP_FRR_B_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_D_READ_REP_FRR_B_VALUE_MSB  7
    #define SI4455_CMD_FRR_D_READ_REP_FRR_B_VALUE_LSB  0
    #define SI4455_CMD_FRR_D_READ_REP_FRR_B_VALUE_INDEX 2
    #define SI4455_CMD_FRR_D_READ_REP_FRR_C_VALUE_TYPE u8
    #define SI4455_CMD_FRR_D_READ_REP_FRR_C_VALUE_SIZE 8
    #define SI4455_CMD_FRR_D_READ_REP_FRR_C_VALUE_MASK 0xFF
    #define SI4455_CMD_FRR_D_READ_REP_FRR_C_VALUE_MSB  7
    #define SI4455_CMD_FRR_D_READ_REP_FRR_C_VALUE_LSB  0
    #define SI4455_CMD_FRR_D_READ_REP_FRR_C_VALUE_INDEX 3

#define SI4455_CMD_ID_WRITE_TX_FIFO                                            0x66
//WRITE_TX_FIFO ARGS
#define SI4455_CMD_ARG_COUNT_WRITE_TX_FIFO                                     2
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_TYPE u8
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_SIZE 8
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_MASK 0xFF
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_MSB  7
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_LSB  0
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_INDEX 1
    #define SI4455_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_value (((cmd.arg.RAW[1])))
//WRITE_TX_FIFO REPLY
#define SI4455_CMD_REPLY_COUNT_WRITE_TX_FIFO                                   0

#define SI4455_CMD_ID_READ_RX_FIFO                                             0x77
//READ_RX_FIFO ARGS
#define SI4455_CMD_ARG_COUNT_READ_RX_FIFO                                      1
//READ_RX_FIFO REPLY
#define SI4455_CMD_REPLY_COUNT_READ_RX_FIFO                                    0


// Property group Id defines.
#define SI4455_PROP_GRP_ID_FRR_CTL                                             2
#define SI4455_PROP_GRP_ID_MATCH                                               48
#define SI4455_PROP_GRP_ID_EZCONFIG                                            36
#define SI4455_PROP_GRP_ID_PA                                                  34
#define SI4455_PROP_GRP_ID_SYNC                                                17
#define SI4455_PROP_GRP_ID_INT_CTL                                             1
#define SI4455_PROP_GRP_ID_OTP_VARS                                            242
#define SI4455_PROP_GRP_ID_FREQ_CONTROL                                        64

// Property group length defines.
#define SI4455_PROP_GRP_LEN_FRR_CTL                                            4
#define SI4455_PROP_GRP_LEN_MATCH                                              12
#define SI4455_PROP_GRP_LEN_EZCONFIG                                           4
#define SI4455_PROP_GRP_LEN_PA                                                 6
#define SI4455_PROP_GRP_LEN_SYNC                                               5
#define SI4455_PROP_GRP_LEN_INT_CTL                                            4
#define SI4455_PROP_GRP_LEN_OTP_VARS                                           45
#define SI4455_PROP_GRP_LEN_FREQ_CONTROL                                       8

// Property index within a group defines.
#define SI4455_PROP_GRP_INDEX_FRR_CTL_A_MODE                                   0
#define SI4455_PROP_GRP_INDEX_FRR_CTL_B_MODE                                   1
#define SI4455_PROP_GRP_INDEX_FRR_CTL_C_MODE                                   2
#define SI4455_PROP_GRP_INDEX_FRR_CTL_D_MODE                                   3

