mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_PROP_GRP_INDEX_MATCH_VALUE_1                                    0
#define SI4455_PROP_GRP_INDEX_MATCH_MASK_1                                     1
#define SI4455_PROP_GRP_INDEX_MATCH_CTRL_1                                     2
#define SI4455_PROP_GRP_INDEX_MATCH_VALUE_2                                    3
#define SI4455_PROP_GRP_INDEX_MATCH_MASK_2                                     4
#define SI4455_PROP_GRP_INDEX_MATCH_CTRL_2                                     5
#define SI4455_PROP_GRP_INDEX_MATCH_VALUE_3                                    6
#define SI4455_PROP_GRP_INDEX_MATCH_MASK_3                                     7
#define SI4455_PROP_GRP_INDEX_MATCH_CTRL_3                                     8
#define SI4455_PROP_GRP_INDEX_MATCH_VALUE_4                                    9
#define SI4455_PROP_GRP_INDEX_MATCH_MASK_4                                     10
#define SI4455_PROP_GRP_INDEX_MATCH_CTRL_4                                     11

#define SI4455_PROP_GRP_INDEX_EZCONFIG_MODULATION                              0
#define SI4455_PROP_GRP_INDEX_EZCONFIG_CONFIG_SELECT                           1
#define SI4455_PROP_GRP_INDEX_EZCONFIG_PKT                                     2
#define SI4455_PROP_GRP_INDEX_EZCONFIG_XO_TUNE                                 3
#define SI4455_PROP_GRP_INDEX_EZCONFIG_SPARE0                                  4
#define SI4455_PROP_GRP_INDEX_EZCONFIG_SPARE1                                  5
#define SI4455_PROP_GRP_INDEX_EZCONFIG_SPARE2                                  6
#define SI4455_PROP_GRP_INDEX_EZCONFIG_SPARE3                                  7
#define SI4455_PROP_GRP_INDEX_EZCONFIG_SPARE4                                  8

#define SI4455_PROP_GRP_INDEX_PA_PAD0                                          6
#define SI4455_PROP_GRP_INDEX_PA_PWR_LVL                                       1
#define SI4455_PROP_GRP_INDEX_PA_BIAS_CLKDUTY                                  2
#define SI4455_PROP_GRP_INDEX_PA_TC                                            3
#define SI4455_PROP_GRP_INDEX_PA_RAMP_EX                                       4
#define SI4455_PROP_GRP_INDEX_PA_RAMP_DOWN_DELAY                               5

#define SI4455-PROP_GRP_INDEX_SYNC_CONFIG                                      0
#define SI4455_PROP_GRP_INDEX_SYNC_BITS_31_24                                  1
#define SI4455_PROP_GRP_INDEX_SYNC_BITS_23_16                                  2
#define SI4455_PROP_GRP_INDEX_SYNC_BITS_15_8                                   3
#define SI4455_PROP_GRP_INDEX_SYNC_BITS_7_0                                    4

#define SI4455_PROP_GRP_INDEX_INT_CTL_ENABLE                                   0
#define SI4455_PROP_GRP_INDEX_INT_CTL_PH_ENABLE                                1
#define SI4455_PROP_GRP_INDEX_INT_CTL_MODEM_ENABLE                             2
#define SI4455_PROP_GRP_INDEX_INT_CTL_CHIP_ENABLE                              3

#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_INTE                                0
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_FRAC_2                              1
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_FRAC_1                              2
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_FRAC_0                              3
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_CHANNEL_STEP_SIZE_1                 4
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_CHANNEL_STEP_SIZE_0                 5
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_W_SIZE                              6
#define SI4455_PROP_GRP_INDEX_FREQ_CONTROL_VCOCNT_RX_ADJ                       7

// Defines for fields within the properties.
#define SI4455_PROP_INT_CTL_ENABLE_MASK                                        0xFF
#define SI4455_PROP_INT_CTL_ENABLE_DEFAULT                                     0x04
#define SI4455_PROP_INT_CTL_ENABLE_CHIP_INT_STATUS_EN_SIZE                     1
#define SI4455_PROP_INT_CTL_ENABLE_CHIP_INT_STATUS_EN_LSB                      2
#define SI4455_PROP_INT_CTL_ENABLE_CHIP_INT_STATUS_EN_MSB                      2
#define SI4455_PROP_INT_CTL_ENABLE_CHIP_INT_STATUS_EN_MASK                     0x4
#define SI4455_PROP_INT_CTL_ENABLE_CHIP_INT_STATUS_EN_BIT                      0x4
#define SI4455_PROP_INT_CTL_ENABLE_MODEM_INT_STATUS_EN_SIZE                    1
#define SI4455_PROP_INT_CTL_ENABLE_MODEM_INT_STATUS_EN_LSB                     1
#define SI4455_PROP_INT_CTL_ENABLE_MODEM_INT_STATUS_EN_MSB                     1
#define SI4455_PROP_INT_CTL_ENABLE_MODEM_INT_STATUS_EN_MASK                    0x2
#define SI4455_PROP_INT_CTL_ENABLE_MODEM_INT_STATUS_EN_BIT                     0x2
#define SI4455_PROP_INT_CTL_ENABLE_PH_INT_STATUS_EN_SIZE                       1
#define SI4455_PROP_INT_CTL_ENABLE_PH_INT_STATUS_EN_LSB                        0
#define SI4455_PROP_INT_CTL_ENABLE_PH_INT_STATUS_EN_MSB                        0
#define SI4455_PROP_INT_CTL_ENABLE_PH_INT_STATUS_EN_MASK                       0x1
#define SI4455_PROP_INT_CTL_ENABLE_PH_INT_STATUS_EN_BIT                        0x1

#define SI4455_PROP_INT_CTL_PH_ENABLE_MASK                                     0xFF
#define SI4455_PROP_INT_CTL_PH_ENABLE_DEFAULT                                  0x00
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_SIZE                      1
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_LSB                       5
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_MSB                       5
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_MASK                      0x20
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_SENT_EN_BIT                       0x20
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_SIZE                        1
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_LSB                         4
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_MSB                         4
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_MASK                        0x10
#define SI4455_PROP_INT_CTL_PH_ENABLE_PACKET_RX_EN_BIT                         0x10
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_SIZE                        1
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_LSB                         3
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_MSB                         3
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_MASK                        0x8
#define SI4455_PROP_INT_CTL_PH_ENABLE_CRC_ERROR_EN_BIT                         0x8
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_SIZE             1
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_LSB              1
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_MSB              1
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_MASK             0x2
#define SI4455_PROP_INT_CTL_PH_ENABLE_TX_FIFO_ALMOST_EMPTY_EN_BIT              0x2
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_SIZE              1
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_LSB               0
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_MSB               0
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_MASK              0x1
#define SI4455_PROP_INT_CTL_PH_ENABLE_RX_FIFO_ALMOST_FULL_EN_BIT               0x1

#define SI4455_PROP_INT_CTL_MODEM_ENABLE_MASK                                  0xFF
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_DEFAULT                               0x00
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_SIZE              1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_LSB               6
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_MSB               6
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_MASK              0x40
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_POSTAMBLE_DETECT_EN_BIT               0x40
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_SIZE                  1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_LSB                   5
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_MSB                   5
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_MASK                  0x20
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_SYNC_EN_BIT                   0x20
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_SIZE                     1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_LSB                      4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_MSB                      4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_MASK                     0x10
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_JUMP_EN_BIT                      0x10
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_SIZE                          1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_LSB                           3
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_MSB                           3
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_MASK                          0x8
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_RSSI_EN_BIT                           0x8
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_SIZE              1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_LSB               2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_MSB               2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_MASK              0x4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_INVALID_PREAMBLE_EN_BIT               0x4
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_SIZE               1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_LSB                1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_MSB                1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_MASK               0x2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_PREAMBLE_DETECT_EN_BIT                0x2
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_SIZE                   1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_LSB                    0
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_MSB                    0
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_MASK                   0x1
#define SI4455_PROP_INT_CTL_MODEM_ENABLE_SYNC_DETECT_EN_BIT                    0x1

#define SI4455_PROP_INT_CTL_CHIP_ENABLE_MASK                                   0xFF
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_DEFAULT                                0x04
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_SIZE                            1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_LSB                             6
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_MSB                             6
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_MASK                            0x40
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CAL_EN_BIT                             0x40
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_SIZE  1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_LSB   5
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_MSB   5
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_MASK  0x20
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_FIFO_UNDERFLOW_OVERFLOW_ERROR_EN_BIT   0x20
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_SIZE                   1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_LSB                    4
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_MSB                    4
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_MASK                   0x10
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_STATE_CHANGE_EN_BIT                    0x10
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_SIZE                      1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_LSB                       3
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_MSB                       3
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_MASK                      0x8
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CMD_ERROR_EN_BIT                       0x8
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_SIZE                     1
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_LSB                      2
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_MSB                      2
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_MASK                     0x4
#define SI4455_PROP_INT_CTL_CHIP_ENABLE_CHIP_READY_EN_BIT                      0x4

#define SI4455_PROP_FRR_CTL_A_MODE_MASK                                        0xFF
#define SI4455_PROP_FRR_CTL_A_MODE_DEFAULT                                     0x01
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_SIZE                             8
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_LSB                              0
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_MSB                              7
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_MASK                             0xFF
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_DISABLED                    0
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_STATUS                  1
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_PEND                    2
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_PH_STATUS               3
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_PH_PEND                 4
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_MODEM_STATUS            5
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_MODEM_PEND              6
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_CHIP_STATUS             7
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_INT_CHIP_PEND               8
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_CURRENT_STATE               9
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_LATCHED_RSSI                10
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE0                      11
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE1                      12
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE2                      13
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE3                      14
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE4                      15
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE5                      16
#define SI4455_PROP_FRR_CTL_A_MODE_FRR_A_MODE_ENUM_SPARE6                      17

#define SI4455_PROP_FRR_CTL_B_MODE_MASK                                        0xFF
#define SI4455_PROP_FRR_CTL_B_MODE_DEFAULT                                     0x02
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_SIZE                             8
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_LSB                              0
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_MSB                              7
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_MASK                             0xFF
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_DISABLED                    0
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_STATUS                  1
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_PEND                    2
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_PH_STATUS               3
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_PH_PEND                 4
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_MODEM_STATUS            5
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_MODEM_PEND              6
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_CHIP_STATUS             7
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_INT_CHIP_PEND               8
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_CURRENT_STATE               9
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_LATCHED_RSSI                10
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE0                      11
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE1                      12
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE2                      13
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE3                      14
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE4                      15
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE5                      16
#define SI4455_PROP_FRR_CTL_B_MODE_FRR_B_MODE_ENUM_SPARE6                      17

#define SI4455_PROP_FRR_CTL_C_MODE_MASK                                        0xFF
#define SI4455_PROP_FRR_CTL_C_MODE_DEFAULT                                     0x09
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_SIZE                             8
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_LSB                              0
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_MSB                              7
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_MASK                             0xFF
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_DISABLED                    0
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_STATUS                  1
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_PEND                    2
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_PH_STATUS               3
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_PH_PEND                 4
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_MODEM_STATUS            5
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_MODEM_PEND              6
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_CHIP_STATUS             7
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_INT_CHIP_PEND               8
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_CURRENT_STATE               9
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_LATCHED_RSSI                10
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE0                      11
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE1                      12
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE2                      13
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE3                      14
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE4                      15
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE5                      16
#define SI4455_PROP_FRR_CTL_C_MODE_FRR_C_MODE_ENUM_SPARE6                      17

#define SI4455_PROP_FRR_CTL_D_MODE_MASK                                        0xFF
#define SI4455_PROP_FRR_CTL_D_MODE_DEFAULT                                     0x00
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_SIZE                             8
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_LSB                              0
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_MSB                              7
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_MASK                             0xFF
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_DISABLED                    0
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_STATUS                  1
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_PEND                    2
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_PH_STATUS               3
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_PH_PEND                 4
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_MODEM_STATUS            5
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_MODEM_PEND              6
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_CHIP_STATUS             7
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_INT_CHIP_PEND               8
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_CURRENT_STATE               9
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_LATCHED_RSSI                10
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE0                      11
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE1                      12
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE2                      13
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE3                      14
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE4                      15
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE5                      16
#define SI4455_PROP_FRR_CTL_D_MODE_FRR_D_MODE_ENUM_SPARE6                      17

#define SI4455_PROP_SYNC_BITS_31_24_MASK                                       0xFF
#define SI4455_PROP_SYNC_BITS_31_24_DEFAULT                                    0x2D
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_SIZE                            8
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_LSB                             0
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MSB                             7
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MIN                             0
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MAX                             0xff
#define SI4455_PROP_SYNC_BITS_31_24_BITS_31_24_MASK                            0xFF

