mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_MASK                                    0xFF
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_DEFAULT                                 0x23
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_SIZE                    8
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_LSB                     0
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MSB                     7
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MIN                     1
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MAX                     40
#define SI4455_PROP_PA_RAMP_DOWN_DELAY_RAMP_DOWN_DELAY_MASK                    0xFF

#define SI4455_PROP_EZCONFIG_MODULATION_MASK                                   0xFF
#define SI4455_PROP_EZCONFIG_MODULATION_DEFAULT                                0x02
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_SIZE               1
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_LSB                7
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_MSB                7
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_MASK               0x80
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_BIT                0x80
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_ENUM_SYNC          0
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_TYPE_ENUM_ASYNC         1
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_SIZE               2
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_LSB                5
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_MSB                6
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_MASK               0x60
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_ENUM_GPIO0         0
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_ENUM_GPIO1         1
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_ENUM_GPIO2         2
#define SI4455_PROP_EZCONFIG_MODULATION_TX_DIRECT_MODE_GPIO_ENUM_GPIO3         3
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_SIZE                        2
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_LSB                         3
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_MSB                         4
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_MASK                        0x18
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_ENUM_PACKET                 0
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_ENUM_DIRECT                 1
#define SI4455_PROP_EZCONFIG_MODULATION_MOD_SOURCE_ENUM_PSEUDO                 2

#define SI4455_PROP_EZCONFIG_XO_TUNE_MASK                                      0xFF
#define SI4455_PROP_EZCONFIG_XO_TUNE_DEFAULT                                   0x40
#define SI4455_PROP_EZCONFIG_XO_TUNE_TUNE_VALUE_SIZE                           7
#define SI4455_PROP_EZCONFIG_XO_TUNE_TUNE_VALUE_LSB                            0
#define SI4455_PROP_EZCONFIG_XO_TUNE_TUNE_VALUE_MSB                            6
#define SI4455_PROP_EZCONFIG_XO_TUNE_TUNE_VALUE_MASK                           0x7F
#define SI4455_PROP_EZCONFIG_XO_TUNE_TUNE_VALUE_ENUM_FASTEST_FREQUENCY         0
#define SI4455_PROP_EZCONFIG_XO_TUNE_TUNE_VALUE_ENUM_SLOWEST_FREQUENCY         127

#define SI4455_PROP_MATCH_VALUE_1_MASK                                         0xFF
#define SI4455_PROP_MATCH_VALUE_1_DEFAULT                                      0x00
#define SI4455_PROP_MATCH_VALUE_1_VALUE_1_SIZE                                 8
#define SI4455_PROP_MATCH_VALUE_1_VALUE_1_LSB                                  0
#define SI4455_PROP_MATCH_VALUE_1_VALUE_1_MSB                                  7
#define SI4455_PROP_MATCH_VALUE_1_VALUE_1_MIN                                  0
#define SI4455_PROP_MATCH_VALUE_1_VALUE_1_MAX                                  0xFF
#define SI4455_PROP_MATCH_VALUE_1_VALUE_1_MASK                                 0xFF

#define SI4455_PROP_MATCH_MASK_1_MASK                                          0xFF
#define SI4455_PROP_MATCH_MASK_1_DEFAULT                                       0x00
#define SI4455_PROP_MATCH_MASK_1_MASK_1_SIZE                                   8
#define SI4455_PROP_MATCH_MASK_1_MASK_1_LSB                                    0
#define SI4455_PROP_MATCH_MASK_1_MASK_1_MSB                                    7
#define SI4455_PROP_MATCH_MASK_1_MASK_1_MIN                                    0
#define SI4455_PROP_MATCH_MASK_1_MASK_1_MAX                                    0xFF
#define SI4455_PROP_MATCH_MASK_1_MASK_1_MASK                                   0xFF

#define SI4455_PROP_MATCH_CTRL_1_MASK                                          0xFF
#define SI4455_PROP_MATCH_CTRL_1_DEFAULT                                       0x00
#define SI4455_PROP_MATCH_CTRL_1_POLARITY_SIZE                                 1
#define SI4455_PROP_MATCH_CTRL_1_POLARITY_LSB                                  7
#define SI4455_PROP_MATCH_CTRL_1_POLARITY_MSB                                  7
#define SI4455_PROP_MATCH_CTRL_1_POLARITY_MASK                                 0x80
#define SI4455_PROP_MATCH_CTRL_1_POLARITY_BIT                                  0x80
#define SI4455_PROP_MATCH_CTRL_1_MATCH_EN_SIZE                                 1
#define SI4455_PROP_MATCH_CTRL_1_MATCH_EN_LSB                                  6
#define SI4455_PROP_MATCH_CTRL_1_MATCH_EN_MSB                                  6
#define SI4455_PROP_MATCH_CTRL_1_MATCH_EN_MASK                                 0x40
#define SI4455_PROP_MATCH_CTRL_1_MATCH_EN_BIT                                  0x40
#define SI4455_PROP_MATCH_CTRL_1_MATCH_EN_ENUM_MATCH_ENABLE                    1
#define SI4455_PROP_MATCH_CTRL_1_OFFSET_SIZE                                   5
#define SI4455_PROP_MATCH_CTRL_1_OFFSET_LSB                                    0
#define SI4455_PROP_MATCH_CTRL_1_OFFSET_MSB                                    4
#define SI4455_PROP_MATCH_CTRL_1_OFFSET_MIN                                    0
#define SI4455_PROP_MATCH_CTRL_1_OFFSET_MAX                                    0x1F
#define SI4455_PROP_MATCH_CTRL_1_OFFSET_MASK                                   0x1F

#define SI4455_PROP_MATCH_VALUE_2_MASK                                         0xFF
#define SI4455_PROP_MATCH_VALUE_2_DEFAULT                                      0x00
#define SI4455_PROP_MATCH_VALUE_2_VALUE_2_SIZE                                 8
#define SI4455_PROP_MATCH_VALUE_2_VALUE_2_LSB                                  0
#define SI4455_PROP_MATCH_VALUE_2_VALUE_2_MSB                                  7
#define SI4455_PROP_MATCH_VALUE_2_VALUE_2_MIN                                  0
#define SI4455_PROP_MATCH_VALUE_2_VALUE_2_MAX                                  0xFF
#define SI4455_PROP_MATCH_VALUE_2_VALUE_2_MASK                                 0xFF

