mathiasvr/silabs-8051-sdk/examples/EFM8BB1_SLSTK2020A/Wireless/EFM8BB1_Si4455_Bidirectional_Demo/src/drivers/radio/Si4455/si4455_defs.h
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_MASK                                   0xFF
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_DEFAULT                                0x00
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_SIZE                            8
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_LSB                             0
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MSB                             7
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MIN                             0
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MAX                             255
#define SI4455_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MASK                            0xFF

#define SI4455_PROP_FREQ_CONTROL_FRAC_0_MASK                                   0xFF
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_DEFAULT                                0x00
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_SIZE                            8
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_LSB                             0
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MSB                             7
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MIN                             0
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MAX                             255
#define SI4455_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MASK                            0xFF

#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_MASK                      0xFF
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_DEFAULT                   0x00
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_SIZE  8
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_LSB   0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MSB   7
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MIN   0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MAX   255
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MASK  0xFF

#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_MASK                      0xFF
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_DEFAULT                   0x00
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_SIZE  8
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_LSB   0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MSB   7
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MIN   0
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MAX   255
#define SI4455_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MASK  0xFF

#define SI4455_PROP_FREQ_CONTROL_W_SIZE_MASK                                   0xFF
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_DEFAULT                                0x20
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_SIZE                            8
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_LSB                             0
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MSB                             7
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MIN                             0
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MAX                             255
#define SI4455_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MASK                            0xFF

#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_MASK                            0xFF
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_DEFAULT                         0xFF
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_SIZE              8
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_LSB               0
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MSB               7
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MIN               -128
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MAX               127
#define SI4455_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MASK              0xFF

#endif // _SI4455_DEFS_H_
